In [1]:
import pandas as pd

In [2]:
data = { 
        "Name" : ["a", "b", "c"],
        "Age" : [28,23,25]
        }
df = pd.DataFrame(data)
print(df)

  Name  Age
0    a   28
1    b   23
2    c   25

In [56]:
# read
df = pd.read_csv("./data.csv")
print(df)

      Name   Age   Salary
0   Hassan    32     1000
1      Ali    33     4000
2    Vahid    32     2500
3   Behnam    33     3400
4  Mahmoud    30     2400
5    Zahra    28     3300
6   Maryam    28     2700

In [5]:
df.head()

      Name   Age   Salary
0   Hassan    32     1000
1      Ali    33     4000
2    Vahid    32     2500
3   Behnam    33     3400
4  Mahmoud    30     2400

In [6]:
df.describe()

             Age       Salary
count   7.000000     7.000000
mean   30.857143  2757.142857
std     2.193063   960.654539
min    28.000000  1000.000000
25%    29.000000  2450.000000
50%    32.000000  2700.000000
75%    32.500000  3350.000000
max    33.000000  4000.000000

In [7]:
df['Name']

0     Hassan
1        Ali
2      Vahid
3     Behnam
4    Mahmoud
5      Zahra
6     Maryam
Name: Name, dtype: object

In [8]:
df.iloc[2,:]

Name       Vahid
 Age          32
 Salary     2500
Name: 2, dtype: object

In [9]:
df.iloc[2,1]

np.int64(32)

In [ ]:
# filter
filtered = df.loc[df[" Salary"] > 2500]
print(filtered)
filtered = df[df[" Salary"] > 2500]
print(filtered)

     Name   Age   Salary
1     Ali    33     4000
3  Behnam    33     3400
5   Zahra    28     3300
6  Maryam    28     2700
     Name   Age   Salary
1     Ali    33     4000
3  Behnam    33     3400
5   Zahra    28     3300
6  Maryam    28     2700

In [36]:
# sort
sorted_df = sorted(df[" Age"])
print(sorted_df)
df_sorted = df.sort_values([" Salary", " Age"], ascending=False)
print(df_sorted)
df_sorted = df_sorted.reset_index()
print(df_sorted)

[28, 28, 30, 32, 32, 33, 33]
      Name   Age   Salary
1      Ali    33     4000
3   Behnam    33     3400
5    Zahra    28     3300
6   Maryam    28     2700
2    Vahid    32     2500
4  Mahmoud    30     2400
0   Hassan    32     1000
   index     Name   Age   Salary
0      1      Ali    33     4000
1      3   Behnam    33     3400
2      5    Zahra    28     3300
3      6   Maryam    28     2700
4      2    Vahid    32     2500
5      4  Mahmoud    30     2400
6      0   Hassan    32     1000

In [42]:
#subset
subset = df.loc[2:4,]
print(subset)
subset = df.loc[2:4,["Name", " Age"]]
print(subset)

      Name   Age   Salary
2    Vahid    32     2500
3   Behnam    33     3400
4  Mahmoud    30     2400
      Name   Age
2    Vahid    32
3   Behnam    33
4  Mahmoud    30

In [45]:
# group
group_df = df.groupby(" Age")
print(group_df)
group_df.count()

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000184663AD310>

      Name   Salary
 Age
28       2        2
30       1        1
32       2        2
33       2        2

In [48]:
# add new column
df["test"] = [1,2,3,4,5,6,7]
df

      Name   Age   Salary  test
0   Hassan    32     1000     1
1      Ali    33     4000     2
2    Vahid    32     2500     3
3   Behnam    33     3400     4
4  Mahmoud    30     2400     5
5    Zahra    28     3300     6
6   Maryam    28     2700     7

In [55]:
# delete a column
df.drop("test", axis = 1, inplace=True)
df

KeyError: "['test'] not found in axis"

In [61]:
# add new row
print(len(df))
df.loc[len(df)] = {
    "Name": "Test",
    " Age": 28
}
df

7

      Name   Age   Salary
0   Hassan    32   1000.0
1      Ali    33   4000.0
2    Vahid    32   2500.0
3   Behnam    33   3400.0
4  Mahmoud    30   2400.0
5    Zahra    28   3300.0
6   Maryam    28   2700.0
7     Test    28      NaN

In [62]:
df.isna()

    Name    Age   Salary
0  False  False    False
1  False  False    False
2  False  False    False
3  False  False    False
4  False  False    False
5  False  False    False
6  False  False    False
7  False  False     True

In [63]:
df1 = df.dropna()
df1

      Name   Age   Salary
0   Hassan    32   1000.0
1      Ali    33   4000.0
2    Vahid    32   2500.0
3   Behnam    33   3400.0
4  Mahmoud    30   2400.0
5    Zahra    28   3300.0
6   Maryam    28   2700.0

In [64]:
df2 = df.fillna(0)
df2

      Name   Age   Salary
0   Hassan    32   1000.0
1      Ali    33   4000.0
2    Vahid    32   2500.0
3   Behnam    33   3400.0
4  Mahmoud    30   2400.0
5    Zahra    28   3300.0
6   Maryam    28   2700.0
7     Test    28      0.0

In [66]:
# write
df.to_csv("new_data.csv")